# If-else statement

In [5]:
x = -10
if x > 0:
    print("Positive")
    print("Congrats")
else:
    print("Negative")
    print("Be Positive")

Negative
Be Positive

In [7]:
x = 0
if x == 0:
    print("Zero")
else:
    print("Hero")

Zero

In [11]:
mark = int(input("Enter the Number :"))
if mark > 85:
    print("Distinction")
elif mark >= 60:
    print("First class")
elif mark >=50 :
    print("Second class")
else:
    print("Fail")

Enter the Number :90
Distinction

### Loops

In [12]:
lst = [34,57,78,21,90,65]

In [16]:
for mark in lst:
    if mark > 85:
        print(mark," -> Distinction")
    elif mark >= 60:
        print(mark," -> First class")
    elif mark >=50 :
        print(mark," -> Second class")
    else:
        print(mark," -> Fail")

34  -> Fail
57  -> Second class
78  -> First class
21  -> Fail
90  -> Distinction
65  -> First class

In [17]:
for x in range(5):
    print(x)

0
1
2
3
4

In [18]:
for x in range(1,6):
    print(x)

1
2
3
4
5

In [19]:
for x in range(1,102,20):
    print(x)

1
21
41
61
81
101

### While Loop

In [20]:
cnt = 0
while cnt < 3:
    print("Hello")
    cnt +=1
print("Finish")

Hello
Hello
Hello
Finish

### Break-come out of Loop

In [23]:
cnt = 0
while cnt < 5:
    print("Hello")
    cnt +=1
    if cnt == 3:
        break
print("Finish")

Hello
Hello
Hello
Finish

In [25]:
lst = [94,57,78,21,90,65]

In [26]:
for mark in lst:
    if mark > 85:
        print(mark," -> Distinction")
    elif mark >= 60:
        print(mark," -> First class")
    elif mark >=50 :
        print(mark," -> Second class")
    else:
        print(mark," -> Fail")
        break
print("Come out off loop")

94  -> Distinction
57  -> Second class
78  -> First class
21  -> Fail
Come out off loop

### Continue- go back to begining

In [28]:
lst = [94,47,78,21,90,65]

In [29]:
for mark in lst:
    if mark > 85:
        print(mark," -> Distinction")
    elif mark >= 60:
        print(mark," -> First class")
    elif mark >=50 :
        print(mark," -> Second class")
    else:
        continue
        print(mark," -> Fail")
        
print("Continue")

94  -> Distinction
78  -> First class
90  -> Distinction
65  -> First class
Continue

In [33]:
for i in lst:
    if i%2!=0:
        continue
    print(i)

94
78
90

## Functions- Reuse the code

In [34]:
def sqr(x):
    return x**2

In [36]:
sqr(7)

49

In [40]:
def get_bonus(sal):
    '''
    Calculates the bonus
    Parameters:salary
    Returns:salary plus bonus
    '''
    bonus = sal *0.2
    total_sal = sal + bonus
    return total_sal

In [41]:
get_bonus(60000)

72000.0

In [57]:
def get_grade(marks):
    if marks >= 85:
        grade="Distinction"
    elif marks >= 60:
        grade="First class"
    elif marks >=50 :
        grade="Second class"
    else:
        grade="Fail"
    return grade

In [61]:
get_grade(44)

'Fail'

In [1]:
lst = [94,47,78,21,90,65]

In [8]:
def get_grade(lst):
    grade_list = []
    for marks in lst:
        if marks >= 85:
            grade="Distinction"
        elif marks >= 60:
            grade="First class"
        elif marks >=50 :
            grade="Second class"
        else:
            grade="Fail"
        grade_list.append(grade)
        
    return grade_list

In [9]:
get_grade(lst)

['Distinction', 'Fail', 'First class', 'Fail', 'Distinction', 'First class']

## List comprehension

In [10]:
orig_lst = [3,8,12,9,5]

In [11]:
sqr_lst = []
for i in orig_lst:
    sqr_lst.append(i**2)

In [12]:
sqr_lst

[9, 64, 144, 81, 25]

In [13]:
new_lst = [i**2 for i in orig_lst]

In [14]:
new_lst

[9, 64, 144, 81, 25]

## Class

In [17]:
class Person:
    def __init__(self,name,gender):
        self.name = name
        self.gender = gender
    def speak(self):
        print(f'{self.name} is speaking')
    def sing(self):
        print(f'{self.name} is singing')
    def run(self):
        print(f'{self.name} is runing')

In [18]:
# Creating objects of p1 and p2
p1 = Person("Tom","M")
p2 = Person("Mary","F")

In [19]:
p1.sing()

Tom is singing

In [20]:
p2.speak()

Mary is speaking

In [21]:
import pandas as pd

In [22]:
emp_data = [[1,"Tom","Mgr",1500],[2,"Jon","Pgmr",2500],[3,"Mary","Clerk",3500]]

In [25]:
df1 = pd.DataFrame(data=emp_data)
df1

   0     1      2     3
0  1   Tom    Mgr  1500
1  2   Jon   Pgmr  2500
2  3  Mary  Clerk  3500

In [26]:
df2 = pd.DataFrame(data=emp_data,columns=["Eid","Ename","Job","Salary"])

In [27]:
df2

   Eid Ename    Job  Salary
0    1   Tom    Mgr    1500
1    2   Jon   Pgmr    2500
2    3  Mary  Clerk    3500

In [28]:
df2 = pd.DataFrame(data=emp_data,columns=["Eid","Ename","Job","Salary"],
                  index=["E1","E2","E3"])

In [29]:
df2

    Eid Ename    Job  Salary
E1    1   Tom    Mgr    1500
E2    2   Jon   Pgmr    2500
E3    3  Mary  Clerk    3500

## Access Columns

In [31]:
df2["Ename"]

E1     Tom
E2     Jon
E3    Mary
Name: Ename, dtype: object

In [32]:
df2[["Ename","Salary"]]

   Ename  Salary
E1   Tom    1500
E2   Jon    2500
E3  Mary    3500

In [33]:
df2.iloc[:,1]

E1     Tom
E2     Jon
E3    Mary
Name: Ename, dtype: object

In [35]:
df2.iloc[:,2]

E1      Mgr
E2     Pgmr
E3    Clerk
Name: Job, dtype: object

In [36]:
df2.iloc[:,1:3]

   Ename    Job
E1   Tom    Mgr
E2   Jon   Pgmr
E3  Mary  Clerk

In [37]:
df2.loc["E1"]

Eid          1
Ename      Tom
Job        Mgr
Salary    1500
Name: E1, dtype: object

In [38]:
df2.loc["E1":"E2"]

    Eid Ename   Job  Salary
E1    1   Tom   Mgr    1500
E2    2   Jon  Pgmr    2500

In [39]:
df2.loc[["E1","E3"]]

    Eid Ename    Job  Salary
E1    1   Tom    Mgr    1500
E3    3  Mary  Clerk    3500

In [40]:
df2.iloc[1]

Eid          2
Ename      Jon
Job       Pgmr
Salary    2500
Name: E2, dtype: object

In [41]:
df2.iloc[1:3]

    Eid Ename    Job  Salary
E2    2   Jon   Pgmr    2500
E3    3  Mary  Clerk    3500

In [47]:
df2[df2["Salary"]>2000]

    Eid Ename    Job  Salary
E2    2   Jon   Pgmr    2500
E3    3  Mary  Clerk    3500

In [48]:
df2[(df2["Salary"]>2000)&(df2["Salary"]<3000)]

    Eid Ename   Job  Salary
E2    2   Jon  Pgmr    2500